//---1------
//
// let a = +prompt('Введите число', " ");
// if (a==0) {
//     alert("Верно");
// }
// else if (a==1){
//     alert("Неверно");
// }
//---2------

// let a = +prompt('Введите число', " ");
// if (a > 0) {
//     alert("Верно");
// }
// else if (a < 1){
//     alert("Неверно");
// }

//---3---------

// let a = +prompt('Введите число', " ");
// if (a < 0) {
//     alert("Верно");
// }
// else {
//     alert("Неверно");
// }

//---4----------------

// let a = +prompt('Введите число', " ");
// if (a >= 0) {
//     alert("Верно");
// }
// else {
//     alert("Неверно");
// }

//---5---------------

// let a = +prompt('Введите число', " ");
// if (a <= 0) {
//     alert("Верно");
// }
// else {
//     alert("Неверно");
// }

//---6------------------

// let a = +prompt('Введите число', " ");
// if (a != 0) {
//     alert("Верно");
// }
// else {
//     alert("Неверно");
// }

//---7-------------------

// let a = prompt('Введите слово', " ");
// if (a = 'test') {
//     alert("Верно");
// }
// else {
//     alert("Неверно");
// }

//---8----------------------

// let a = +prompt('Введите число', " ");
// if (a === 1) {
//     alert("Верно");
// }
// else {
//     alert("Неверно");
// }

//---9--------------------------

// let a = +prompt('Введите число', " ");
//
//  if (a > 0 && a < 5)
// {
//     alert( 'Верно!' );
// } else {
//     alert( 'Не верно!' );
// }

 //---10---------------------------

// let a = +prompt('Введите число', " ");
// switch (a) {
//     case 0:
//     case 2:
//         alert(a + 7);
// break;
// default:
//     alert(a / 10);
// }


// let a = +prompt('Введите число', " ");
// if (a === 0 || a === 2) {
//     alert(a + 7);
// }
// else{
//     alert(a / 10);
// }


//---11--------------------------------

// let a = +prompt('Введите число a', " ");
// let b = +prompt('Введите число b', " ");
// if (a <= 1 && b >= 3){
//     alert(a + b);
// }
// else{
//     alert(a - b);
// }

//---12------------------------------------

let a = +prompt('Введите число a', " ");
let b = +prompt('Введите число b', " ");
if (a > 2 && a < 11){
    alert('Верно');
}
else if(b >= 6 && b < 14){
    alert('Верно');
}
else{
    alert('Неверно');
}

//---13--------------------------------------

// let num = +prompt('Введите число от 1 до 4', " ");
// switch (num){
//     case 1:
//         alert('Зима');
//         break;
//     case 2:
//         alert('Весна');
//         break;
//     case 3:
//         alert('Лето');
//         break;
//     case 4:
//         alert('Осень');
//     default:
//         alert('Неверно');
// }
